[
  "More companies are pointing to AI as they lay off employees - CBS News (2026-02-03)",
  "Asian software stocks plunge after U.S. peers decline on fears over AI-led disruption - CNBC (2026-02-04)",
  "NASA's Perseverance Rover Completes the First AI-planned Drive on Mars - ScienceDaily (2026-02-02)",
  "Scientists Are Racing to Define AI Consciousness - 'Existential Risk' Warned - ScienceDaily (2026-02-01)",
  "US Cyber Defense Chief Accidentally Uploaded Secret Government Info to ChatGPT - Ars Technica (2026-01-28)",
  "Google Begins Rolling Out Chrome's 'Auto Browse' AI Agent - Ars Technica (2026-01-28)",
  "U.K. Launches Investigation Into X's Grok AI Platform - WSJ (today)",
  "ClickHouse valued at $15B riding AI wave - Reuters (today)",
  "Job Seekers Train AI to Do Their Old Roles - WSJ (today)",
  "AI CEO: 50% of white-collar jobs gone in 5 years - CNN (today)",
  "What is the 'social media network for AI' Moltbook? - BBC News (2 hrs ago)",
  "'I broke up with my AI companion' - BBC News (6 hrs ago)",
  "AI 'slop' is transforming social media - BBC News (9 hrs ago)",
  "California demands xAI stop sexual deepfakes - Reuters (today)",
  "OpenAI to test ads in ChatGPT - Reuters (today)",
  "SpaceX to take over Elon Musk's AI firm - BBC News (2026-02-02)",
  "What is the 'social media network for AI' Moltbook? - BBC News (2026-02-02)",
  "'I broke up with my AI companion' - BBC News (2026-02-02)",
  "AI 'slop' is transforming social media - and a backlash is brewing - BBC News (2026-02-02)",
  "Starbucks bets on robots to brew a turnaround in customers - BBC News (2026-02-02)",
  "Google DeepMind launches AI tool to help identify genetic drivers of disease - The Guardian (2026-02-02)",
  "China lags behind US at AI frontier but could quickly catch up - The Guardian (2026-02-02)",
  "Advancements in AI Aim to Decode Animal Communication - TME News (2026-02-02)",
  "Revolutionary AI Model Enhances Liver Tumor Segmentation - TME News (2026-02-02)",
  "This Week in AI (Jan 5 – Jan 11, 2026): Top AI News - AI News Update (2026-01-11)",
  "Google DeepMind's AlphaGo Decodes the Genome - Singularity Hub (2026-01-29)",
  "The Human Brain May Work More Like AI Than Expected - ScienceDaily (2026-01-21)",
  "AI 'Godfather' Yoshua Bengio Finds Fix for AI's Biggest Risks - Fortune (2026-01-15)",
  "Google's AI 'Co-Scientist' Cracked 10-Year Superbug Problem in 2 Days - Live Science (2025-03-16)",
  "Nine Breakthroughs Made Possible by AI - UC San Diego Today (2025-11-21)",
  "Belgian Study Warns Gender Bias is Severely Underestimated in AI Recruitment - Crescendo AI (2026-02-03)",
  "AI-Generated Photos Falsely Link Zohran Mamdani's Mother to Epstein Files - AP News (2026-02-03)",
  "Palladyne AI Secures Major Defense Contract for Propulsion Subsystems - Crescendo AI (2026-02-03)",
  "Starbucks bets on robots to brew a turnaround in customers - BBC News (2026-02-03)",
  "Barnsley named UK's first AI 'Tech Town' - BBC News (2026-02-03)",
  "Sam Altman declares AGI then walks it back - The Verge (2026-02-03)",
  "Anthropic working to fix Claude Code - The Verge (2026-02-03)",
  "SpaceX and xAI merge into $1T+ company - BBC News (2026-02-03)",
  "Anthropic's release of AI tools for lawyers prompts massive legal-tech sell-off - The Globe and Mail (2026-02-04)",
  "'I Don't Write Code Anymore': Anthropic, OpenAI Engineers Say AI Now Writes 100% of Their Code - eWeek (2026-02-03)",
  "Two AI ecosystems are battling for global dominance: US vs China - LinkedIn/Jonathan Brill (2026-02-03)",
  "Major Anthropic Backer Quintuples AI Math Startup's Valuation - The Information (2026-02-03)",
  "OpenAI launches standalone Codex app for macOS - CNBC/VentureBeat (2026-02-02)",
  "Does AI already have human-level intelligence? The evidence is clear - Nature (2026-02-02)",
  "Axtria Announces Ignite Global 2026: AI-first data analytics forum - PR Newswire (2026-02-03)",
  "Is Artificial General Intelligence Here? - UC San Diego (2026-02-03)",
  "Airrived raises $6.1M for agentic AI infrastructure - SiliconANGLE (2026-02-03)",
  "Stony Brook joins Empire AI SUNY campus partnerships - Stony Brook News (2026-02-03)",
  "Security researchers found hundreds of malicious add-ons on ClawHub - The Verge (2026-02-04)",
  "Microsoft-owned GitHub continues to embrace OpenAI and Anthropic AI advances - The Verge (2026-02-04)",
  "Combing the Rackspace blogfiles for operational AI pointers - AI News (2026-02-04)"
]